{
    "20917742": "ProjectPSX – A C# coded emulator of the original Playstation",
    "20918080": "Using Spotify data to predict what songs will be hits",
    "20918089": "Map Shows How a Location Has Changed over the Past 750M Years",
    "20918526": "GCC eBPF for Linux port has landed",
    "20918731": "Most Americans see catastrophic weather events worsening",
    "20918919": "Lingua::Romana::Perligata — Perl in Latin",
    "20918936": "Google bans family cafe for offensive content for posting photo of British dish",
    "20918941": "Google employees say they were retaliated against for reporting harassment",
    "20919147": "Project Naptha: Make Text in Browser Images Selectable",
    "20919172": "Artificial leaf produces first drugs using sunlight",
    "20919461": "‘We May Have to Shoot Down This Aircraft’",
    "20919748": "America’s Electronic Voting System Is Corrupted to the Core",
    "20919916": "Doctors say schools should not allow in children who are not vaccinated",
    "20919927": "Keybase and Stellar Partner on XLM Airdrop Worth $118M",
    "20919948": "Quantum Darwinism spotted in diamond spin",
    "20920555": "Running GitHub on Rails 6.0",
    "20920635": "Ask HN: What things do you wish you discovered earlier?",
    "20920670": "Daytripper",
    "20920731": "50 U.S. states and territories announce broad antitrust investigation of Google",
    "20920753": "9th Circuit holds that scraping a public website does not violate the CFAA [pdf]",
    "20920928": "Effect of High-Dose Vitamin D on Volumetric Bone Density and Bone Strength",
    "20921271": "Why Positive Cashflow Matters",
    "20921343": "Don’t Subsidize Companies That Silence Workers",
    "20921413": "Great Noir Lives and Dies On Dialogue",
    "20921531": "Menstruation Apps Are Sharing Users' Data",
    "20921717": "Amazon Employees Pledge to Walk Out as Part of Global Climate Strike",
    "20922250": "Maturity",
    "20922439": "Health system sues thousands of patients, seizes pay and puts liens on homes",
    "20922767": "Human Rights Implications of IBM Watson’s ‘Personality Insights’ Tool",
    "20922827": "Scientists Discover New Evidence of the Asteroid That Killed Off the Dinosaurs",
    "20923529": "Sosml: An Interpreter for Standard ML Written in TypeScript",
    "20924142": "Unencrypted patient medical information is being broadcast across Vancouver",
    "20924282": "SoftBank is asking for the WeWork IPO to be put on hold",
    "20924581": "Troubles Mount for the We Company as Softbank Reportedly Calls for Shelving IPO",
    "20924667": "It’s not just p=0.048 vs. p=0.052",
    "20924747": "California Lawmakers Vote to Undo N.C.A.A. Amateurism",
    "20924774": "Kīlauea volcano eruption fosters algae bloom in North Pacific Ocean",
    "20925029": "American Phrase Book",
    "20925092": "Bloomberg’s American Mall game (2018)",
    "20925228": "Jack Ma retires as Alibaba’s chairman",
    "20926563": "Django 3.0 alpha 1 released",
    "20926608": "The Riemann Hypothesis (Part 2)",
    "20926655": "Berlin crash prompts calls to ban SUVs from German cities",
    "20926920": "How Safari and iMessage Have Made iPhones Less Secure",
    "20927093": "Margrethe Vestager stays on as EU competition head in blow for tech giants",
    "20927410": "Where Quantum Probability Comes From",
    "20927431": "Secret Service Investigates Breach at U.S. Govt IT Contractor",
    "20927466": "California Labor Bill, Near Passage, Is Blow to Uber and Lyft",
    "20927790": "Myanmar Prepares to Migrate from Zawgyi to Unicode",
    "20927832": "Firefox’s Test Pilot Program Returns",
    "20928080": "Apple Dominates App Store Search Results, Thwarting Competitors",
    "20928161": "The Amazon Is Not the Earth’s Lungs",
    "20928190": "Runaway Story or Meltdown in Motion? The Unraveling of the WeWork IPO",
    "20928384": "Stripe Corporate Card",
    "20928536": "Xip.io: Wildcard DNS for Everyone",
    "20928653": "Epstein Was a Known Sex Offender. Bezos, Musk and Brin Dined with Him Anyway",
    "20928837": "Khashoggi children have received houses in Saudi Arabia and monthly payments",
    "20928902": "Sex lives of app users 'shared with Facebook'",
    "20929070": "Why Are America’s Three Biggest Metros Shrinking?",
    "20929412": "What College Admissions Want",
    "20929419": "Gas Plants Will Get Crushed by Wind, Solar by 2035: Study",
    "20929704": "Americans' fear of losing their jobs grows",
    "20929796": "Michael Bloomberg launches $160M initiative to ban flavored e-cigarettes",
    "20929861": "Kuma, a new universal service mesh",
    "20930270": "Evolving “nofollow” – new ways to identify the nature of links",
    "20930498": "Humans Who Are Not Concentrating Are Not General Intelligences",
    "20930622": "Mayo Clinic to partner with Google",
    "20930649": "Calcium could replace lithium in batteries that store solar and wind power",
    "20930652": "Why Ada Is the Language You Want to Be Programming Your Systems With",
    "20930765": "Apple has unveiled the new seventh-gen iPad",
    "20931042": "Apple Watch Series 5",
    "20931086": "Bill Gates: I met with Epstein because “he knows a lot of rich people”",
    "20931499": "Plasma Antenna",
    "20931512": "Bring Back the SE",
    "20931533": "Photographer Robert Frank has died",
    "20931551": "Expert predicts 25% of colleges will fail in the next 20 years",
    "20931644": "Uber lays off 435 people",
    "20931678": "iPhone 11 Pro and iPhone 11 Pro Max",
    "20931801": "On Extractive and Abstractive Summarization with Transformer Language Models",
    "20932106": "Weakness in Intel chips lets researchers steal encrypted SSH keystrokes",
    "20933080": "Electric version of Renault's low-cost Kwid",
    "20933366": "Terror Watch List Finally Reined In",
    "20934919": "Leadership Transition Announced for MIT Media Lab",
    "20934923": "Can genetics explain why some people thrive on less sleep?",
    "20935409": "Socrates Was Against Writing (2011)",
    "20935660": "DontDuo: Bypass 2FA with DTMF Tones",
    "20935890": "Drought Has Revealed Spain's Long-Submerged 'Stonehenge'",
    "20936210": "Natural Language in Python Using SpaCy: An Introduction",
    "20936388": "The Economic Consequences of the Peace by John Maynard Keynes, 1919",
    "20936472": "Buster Keaton and the Art of the Gag (2015) [video]",
    "20936610": "California passes bill that classifies gig economy workers as employees",
    "20936782": "California senate passes AB5 gig-work bill, turning contractors into employees",
    "20937062": "Stop Infinite Scrolling",
    "20937199": "Almost all Collatz orbits attain almost bounded values",
    "20937215": "Rich Hickey on Datomic (2012) [video]",
    "20937365": "Paul Bernays Lectures",
    "20937371": "Caniuse and MDN compatibility data collaboration",
    "20937950": "Malaria breakthrough as scientists find ‘highly effective’ way to kill parasite",
    "20938011": "Fairphone 3 Teardown",
    "20938279": "The CIA's Secret Quest For Mind Control",
    "20938292": "E.U.’S New Digital Czar: ‘Most Powerful Regulator of Big Tech’",
    "20938327": "The U.S. Forgot What Antitrust Is For",
    "20938411": "Edward Snowden: Permanent Record",
    "20938681": "What happens to tech workers when their skills become obsolete?",
    "20938780": "Trucking 'bloodbath': 4,500 truck drivers lost jobs in August",
    "20938852": "The iPhone and Apple's Services Strategy",
    "20938906": "Intel GPU Instruction Set Architecture Gets First Overhaul Since 2004",
    "20939161": "How the Many-Worlds Theory of Hugh Everett Split the Universe",
    "20939338": "In the Netherlands, a group of scientists is working on feeding 11 billion",
    "20939346": "Giving Up Meat Won’t Have Much of an Effect on Climate Change",
    "20939425": "Hong Kong Exchanges Bids $39B to Take over London Stock Exchange",
    "20939548": "People Recognize Objects by Visualizing Their “Skeletons”",
    "20939688": "The Handshake Network wants to reinvent DNS",
    "20939903": "Day Trading for a Living?",
    "20940535": "Lambdas for C – sort of",
    "20940717": "Prohibition Tossed a Wet Blanket on America’s Inventors",
    "20941039": "NY Payroll Company Vanishes with $35M",
    "20941089": "It's A-Me, HTML Mario",
    "20941191": "Ask HN: What are some more authentic online forums?",
    "20941974": "Professor quietly takes student’s work and files it as a patent in China",
    "20942543": "Postmortem: Every Frame a Painting (2017)",
    "20942561": "Show HN: Jupiter and Its 79 Moons",
    "20942570": "Star Wars is not a Rebellion (2018)",
    "20942608": "Halo: Recursive Proof Composition Without a Trusted Setup",
    "20942614": "Proxying Packages with GitHub Package Registry",
    "20942624": "America is in danger of losing its “measles-free” status",
    "20942641": "Code Intelligence with LSIF",
    "20942651": "India's car industry in breakdown mode",
    "20942656": "World’s First Space Hotel Will Have Artificial Gravity and Open in 2025",
    "20942698": "Unbundling AWS",
    "20942708": "DeepSource Go Analyzer Beta",
    "20942722": "Fira Code v2 released: 136 new glyphs",
    "20942730": "Oculus founder Palmer Luckey scores $1B+ valuation for virtual border wall",
    "20942736": "Global Climatestrike → SEP. 20–27",
    "20942752": "Rocky super-Earth named most habitable known world beyond solar system",
    "20942767": "The Soul of Erlang and Elixir [video]",
    "20942768": "Thoughts on San Francisco after 2 weeks in Europe",
    "20942776": "Experimenting with same-provider DNS-over-HTTPS upgrade",
    "20942796": "NTs don't know social rules",
    "20942805": "COVFEFE Act",
    "20942838": "U.S. Will Move to Ban Flavored E-Cigarettes, Trump Official Says",
    "20942871": "Descartes Labs Impact Science Program",
    "20942882": "NASA’s Hubble Finds Water Vapor on Habitable-Zone Exoplanet for First Time",
    "20942910": "Trump Administration Weighs Ban on Flavored E-Cigarettes",
    "20942918": "The Rise of the Free-Market Economists Who Reshaped Our World",
    "20942932": "Electronic Fund Transfer Act",
    "20942941": "Ford develops bug-resistant self-driving car",
    "20942945": "Water vapour in the atmosphere of habitable-zone eight-Earth-mass planet K2-18b",
    "20942957": "Not all Postgres connection pooling is equal",
    "20942960": "How David Swensen Made Yale Fabulously Rich",
    "20942991": "macOS Catalina will be incompatible with much of your music software",
    "20943003": "The Universe Is Not in a Box: A Conversation with Julian Barbour",
    "20943018": "Most of the Mind Can’t Tell Fact from Fiction",
    "20943025": "Water found for first time on potentially habitable planet",
    "20943065": "Your Macabre Thought for the Day (2011)",
    "20943076": "Offense Archaeology",
    "20943144": "Airwars",
    "20943198": "Microsoft Teams Linux Client Confirmed",
    "20943218": "Let Them Eat Social Networking (2011)",
    "20943271": "CTRL: A Conditional Transformer Language Model for Controllable Generation [pdf]",
    "20943272": "WWII Radio Listener Security",
    "20943282": "The Coming Calamity (2018)",
    "20943304": "Cloud-Services Company Cloudflare Discloses Potential Sanctions Violations",
    "20943319": "The world’s smallest big rocket company",
    "20943323": "Consumer Reports launches digital lab to rate on privacy, inform policy",
    "20943346": "Run a private DNS over HTTPS service",
    "20943406": "Release Notes for Windows Subsystem for Linux (Build 18980)",
    "20943416": "Using WhatsApp to encourage reading and literacy",
    "20943491": "“Fight Club” presaged the darker corners of the internet",
    "20943518": "Social Media in 1979? Yes",
    "20943532": "Tiny Pacific Nation Is Making a Go of Its Own Digital Currency",
    "20943540": "Patron License 1.0.0",
    "20943545": "U.S. Engineering Salaries Jump; Smartphone Developers Win Big",
    "20943550": "Alien world found to have water vapor and possibly rain clouds",
    "20943565": "We Asked Prosecutor If Health Insurance Companies Care About Fraud. They Laughed",
    "20943568": "Elsevier investigates hundreds of peer reviewers for manipulating citations",
    "20943590": "SSC Journal Club: Relaxed Beliefs Under Psychedelics and the Anarchic Brain",
    "20943611": "Secured Android Smartphone",
    "20943612": "DNA Company Tampered with Results",
    "20943613": "The Halfword Heap Emulator (2011) [pdf]",
    "20943633": "After 9\/11, I Raised My Daughters Alone",
    "20943700": "Kreuger: Genius and Swindler – Introduction",
    "20943735": "The hero who saved everything you love about modern cities",
    "20943773": "CA and AL aren't participating in the multi-state Google antitrust case",
    "20943792": "Galois Inc. Tech Talk: A Verified LL(1) Parser Generator",
    "20943809": "Reproducing \"A Large-Scale Study of Programming Languages and Code Quality\"",
    "20943844": "Multiple Ways of API Integration in Your JAMStack",
    "20943866": "Absolute Scale Corrupts Absolutely",
    "20943869": "Samurra Air Battle",
    "20943881": "Time Management – Get my stuff done (2010) [video]",
    "20943918": "Switzerland's guidance on stablecoins – what it means for Facebook's Libra",
    "20943923": "PrivacySafe: The Anti-Cloud Appliance",
    "20943937": "The quest to create quality chocolate for a country obsessed with Cadbury (2017)",
    "20943940": "Understanding Form, Function, and Logic of Clandestine Cellular Networks (2009)",
    "20943986": "UK Government: Operation Yellowhammer Summary [pdf]",
    "20944007": "Themes and Structure in Double Mojo VNs",
    "20944012": "iOS 13 GM continue to reference Apple’s Stereo AR headset efforts",
    "20944033": "Roger McNamee: Facebook’s ‘business model is morally wrong’",
    "20944045": "Worldline puts APIs at the heart of payments services",
    "20944095": "California Bill Makes App-Based Companies (Uber\/Lyft) Treat Workers as Employees",
    "20944123": "AMD improves real-world boost and idle on Ryzen 3000",
    "20944138": "Police warn Heathrow activists against Friday drone disruption plan",
    "20944148": "What is the new Apple U1 chip?",
    "20944158": "Update on AB5",
    "20944198": "Should VMware Change Its Name?",
    "20944202": "Quibi Teams with BBC News on Daily News Show for Millennials",
    "20944211": "Lessons from the Screenplay – Jurassic Park: Using Theme to Craft Character",
    "20944222": "Ten Rules for Negotiating a Job Offer",
    "20944224": "Comb, a suite of monospaced fonts ideal for designing forms",
    "20944254": "Airwars Conflict Data Visualisation",
    "20944255": "Managing Effective Data Science Teams",
    "20944259": "A Conditional Transformer Language Model for Controllable Generation",
    "20944308": "The Mercedes EQS Concept Is Svelte, Sensuous and Sustainable",
    "20944343": "Handmaid's Tale Sequel Published",
    "20944355": "Racial disparities in voting wait times: evidence from smartphone data",
    "20944363": "Lispy language for creating NES \/ Famicom software",
    "20944388": "Nanowires replace Newton’s famous glass prism",
    "20944403": "Why is Rust slightly slower than C?",
    "20944416": "China scraps foreign credit and investment quotas",
    "20944419": "Uber Says It Is Not Subject to California Gig-Worker Law",
    "20944473": "Leon Cooperman Warns Private Equity Is a Risky Bet",
    "20944498": "Cloudflare Boosts IPO Range to $14 per Share, Raising Max Val to $4.2B",
    "20944519": "We Built a Lucene-Inspired Parser in Go",
    "20944544": "A $60k Patrol Boat and a Single Deck Gun Changed the Course of Korean War",
    "20944547": "Deaths of 9\/11 first responders from Ground Zero-related illnesses on the rise",
    "20944574": "A\/B test blog titles and topics",
    "20944606": "281 Alleged Email Scammers Arrested in Global Sweep",
    "20944607": "Microsoft Linux Conference WSLconf Coming March 2020",
    "20944637": "Ask HN: Teach me to write 3rd party java script please?",
    "20944646": "Some thoughts on differential equation notation – functional vs. classical",
    "20944656": "It now costs $350k a year to live a middle-class lifestyle in a big city",
    "20944661": "PID Loops and the Art of Keeping Systems Stable",
    "20944726": "Oil tycoon T. Boone Pickens dies at age 91",
    "20944744": "The Water Vapor Find on 'Habitable' Exoplanet K2-18b",
    "20944790": "The Only Voice That Matters in the iBuyer Debate Is the Consumer's",
    "20944808": "Meet LEO, the world’s first business computer (2018)",
    "20944853": "What makes a mathematician tick? (Explaining BSD to computer scientists) [pdf]",
    "20944859": "Underpopulated Italian region offers visitors €25,000 to move in",
    "20944861": "Parity 7.0.0-Pre.1",
    "20944923": "China Lost the United States First",
    "20944961": "Be patient, overnight success takes many years",
    "20944970": "Most in Demand Skills for JavaScript Engineers",
    "20945106": "Ask HN: Why are browsers so bad at stopping popups and other dark patterns?",
    "20945123": "Huawei may sell its 5G technology to a Western buyer",
    "20945137": "Bletchley's wartime codebreakers meet again",
    "20945254": "iOS 13 and Xcode 11 Changes That Affect Push Notifications",
    "20945294": "Brent Shavnore: The Most Astonishing Case of Image Theft I've Ever Seen",
    "20945297": "Impossible at Home",
    "20945384": "Social media linked to increased risk of mental health problems",
    "20945407": "Notes on the Question – What Is a Startup?",
    "20945514": "Atari ST FD Hardware",
    "20945515": "Life at 400 (2016)",
    "20945517": "Dreamcast launched September 1999",
    "20945519": "Scientists detect the ringing of a newborn black hole for the first time",
    "20945552": "Build Your Own Programming Language with Scala",
    "20945558": "YouTube creators begin shifting channels after FTC fine leaves futures in doubt",
    "20945574": "Supreme Court Backs New Trump Asylum Restrictions",
    "20945606": "Cash-strapped BART considers spending $227M on new downtown Oakland HQ",
    "20945673": "Sophos releases Sandboxie 5.31.4 for free",
    "20945745": "Why Talking to Strangers Is the Best Thing You Can Do for Your Mental Health",
    "20945755": "Would you rather have a lighter racing car or a more powerful one?",
    "20945761": "Feature Visualization How neural networks build up their understanding of images",
    "20945823": "You’re ‘Raised Right’ When You’re Poor",
    "20945830": "With the intimidation of a tech expert, the Ola Bini case hits a new low",
    "20945856": "California Approves Statewide Rent Control",
    "20945875": "Southern Railway Saluda Grade Training (1982) [video]",
    "20945911": "We Lost the War in Afghanistan. Get over It",
    "20946024": "Los Angeles approves 'historically low cost' solar+storage project",
    "20946120": "Swing in Austin",
    "20946221": "Archaeologists unearth mass graves from Mongol invasion of Russia",
    "20946239": "Dissatisfied with Docker",
    "20946242": "Hot Patching SQL Server Engine in Azure SQL Database",
    "20946302": "Recipe for disaster: The meteoric rise and ongoing demise of Blue Apron",
    "20946321": "Amazon Is a Logistical Disaster",
    "20946327": "Why Psychotherapy Works",
    "20946370": "The electric cars are here, now how about selling them",
    "20946371": "Sandboxie is now a free tool with plans to transition it to an open source tool",
    "20946408": "Teenager loses memory every two hours after being kicked in the head",
    "20946459": "A new funding model for open source software",
    "20946545": "Asteroid Discovery – 1970-2015 [video]",
    "20946750": "The campaign to ban conversion therapy",
    "20946816": "The Black Hand",
    "20946866": "Tesla Installs First Customer Upgrade to Full Self Driving Hardware",
    "20946903": "Fancy coffee becomes a must-have office perk",
    "20946910": "Stripe Sessions Keynote",
    "20946976": "The BusTub Relational Database Management System (Educational)",
    "20946996": "Can Anyone Live in Full Software Freedom Today?",
    "20946999": "New metamaterial morphs into new shapes, taking on new properties",
    "20947017": "Argentina announces new round of currency controls amid economic crisis",
    "20947026": "Michael Schumacher 'conscious' after pioneering treatment in Paris",
    "20947028": "Reconsidering Monetary Policy: The Relationship Between Interest Rates and GDP",
    "20947032": "Study suggests that maybe our morals are determined by our political affiliation",
    "20947042": "Britain slumps to bottom of cancer survival tables",
    "20947054": "There's an Actual Guy Named 'Justin' Making Those Nut Butter Packets",
    "20947115": "35C3 – Inside the AMD Microcode ROM",
    "20947315": "When Medicaid Takes Everything You Own",
    "20947424": "Ten Simple Rules for Structuring Papers (2017)",
    "20947526": "Submit Your WatchOS Apps to the App Store",
    "20947542": "How Hardware Can Bias AI Data",
    "20947577": "Medicaid's Dark Secret",
    "20947631": "Rock Pi X Intel Cherry Trail Board",
    "20947685": "You Can't Even See This Hypersonic Sled Hit 6,599 MPH",
    "20947740": "Baby with extremely rare mutation in GPX4 gene",
    "20947744": "If computers are so smart how come they can't read?",
    "20947829": "California AB5 may cause franchise owners to be reclassified as employees",
    "20947858": "People throwing their Juuls out windows and drenching them in water just to quit",
    "20947917": "The Perils of Billionaire Philanthropy",
    "20947936": "Pagers, Pay Phones, and Dialup: How We Communicated on 9\/11",
    "20948022": "Political Diversity in Social and Personality Psychology (2012)",
    "20948053": "Announcing the Urban Institute Data Catalog",
    "20948088": "The Plonk Stack for Cloud Native Developers",
    "20948089": "Brexit, Democracy and the Sacred",
    "20948140": "Tesla announces Model S with ‘Plaid powertrain’ and new ‘chassis prototype’",
    "20948144": "Citation bubble about to burst? (2011)",
    "20948150": "Modern Applications at AWS",
    "20948153": "The nuclear war America planned to fight over her own cities (2017)",
    "20948167": "Getting Started with Text Preprocessing for Machine Learning and NLP",
    "20948220": "Squash: The Debugger for Microservices",
    "20948241": "Apple needs to stop comparing iPad to PC",
    "20948246": "Advertising executives point to five ways Google stifles business",
    "20948257": "Operation reWired: 281 suspected email scammers arrested around the world",
    "20948298": "Berkeley Smorgasbord Part 2",
    "20948307": "Dungeon Crawling or Lucid Dreaming?",
    "20948308": "A Talk with XKCD’s Creator, Randall Munroe"
}