{
    "20917742": "ProjectPSX – A C# coded emulator of the original Playstation",
    "20917803": "Generics in C without void* or macros – enabled by psychec",
    "20917851": "Hugo and IPFS: how this blog works (and scales to serve 5k% spikes instantly)",
    "20918080": "Using Spotify data to predict what songs will be hits",
    "20918089": "Map Shows How a Location Has Changed over the Past 750M Years",
    "20918526": "GCC eBPF for Linux port has landed",
    "20918641": "Show HN: Quickly generate REST API (for Postgres db)",
    "20918731": "Most Americans see catastrophic weather events worsening",
    "20918919": "Lingua::Romana::Perligata — Perl in Latin",
    "20918936": "Google bans family cafe for offensive content for posting photo of British dish",
    "20918941": "Google employees say they were retaliated against for reporting harassment",
    "20919138": "Show HN: wehatecaptchas – we’ll keep the bots out without annoying your users",
    "20919147": "Project Naptha: Make Text in Browser Images Selectable",
    "20919172": "Artificial leaf produces first drugs using sunlight",
    "20919461": "‘We May Have to Shoot Down This Aircraft’",
    "20919696": "How to get into Y Combinator according to the founders that did get in",
    "20919748": "America’s Electronic Voting System Is Corrupted to the Core",
    "20919819": "The Lisp Curse (2011)",
    "20919916": "Doctors say schools should not allow in children who are not vaccinated",
    "20919927": "Keybase and Stellar Partner on XLM Airdrop Worth $118M",
    "20919948": "Quantum Darwinism spotted in diamond spin",
    "20919958": "94k Bitcoin (1B USD) transferred from unknown wallet to unknown wallet",
    "20920555": "Running GitHub on Rails 6.0",
    "20920635": "Ask HN: What things do you wish you discovered earlier?",
    "20920670": "Daytripper",
    "20920731": "50 U.S. states and territories announce broad antitrust investigation of Google",
    "20920753": "9th Circuit holds that scraping a public website does not violate the CFAA [pdf]",
    "20920928": "Effect of High-Dose Vitamin D on Volumetric Bone Density and Bone Strength",
    "20921146": "Recession Already Grips Corners of U.S., Menacing Trump’s 2020 Bid",
    "20921271": "Why Positive Cashflow Matters",
    "20921343": "Don’t Subsidize Companies That Silence Workers",
    "20921413": "Great Noir Lives and Dies On Dialogue",
    "20921531": "Menstruation Apps Are Sharing Users' Data",
    "20921572": "Waltz: A Distributed Write-Ahead Log",
    "20921717": "Amazon Employees Pledge to Walk Out as Part of Global Climate Strike",
    "20921962": "Show HN: Enter your URL and view CVEs affecting your stack over last 6 months",
    "20922250": "Maturity",
    "20922439": "Health system sues thousands of patients, seizes pay and puts liens on homes",
    "20922767": "Human Rights Implications of IBM Watson’s ‘Personality Insights’ Tool",
    "20922827": "Scientists Discover New Evidence of the Asteroid That Killed Off the Dinosaurs",
    "20922855": "New games for the Atari Lynx",
    "20923529": "Sosml: An Interpreter for Standard ML Written in TypeScript",
    "20923792": "Show HN: Cyberpunk web design made easy, really easy",
    "20923823": "Universal Resume Template",
    "20924142": "Unencrypted patient medical information is being broadcast across Vancouver",
    "20924277": "Airbnb: A fan legally constitutes an air conditioner",
    "20924282": "SoftBank is asking for the WeWork IPO to be put on hold",
    "20924474": "Hong Kong Protests: The most striking illustrations from the movement so far",
    "20924552": "Ballerina, a language with structural type system",
    "20924581": "Troubles Mount for the We Company as Softbank Reportedly Calls for Shelving IPO",
    "20924667": "It’s not just p=0.048 vs. p=0.052",
    "20924747": "California Lawmakers Vote to Undo N.C.A.A. Amateurism",
    "20924774": "Kīlauea volcano eruption fosters algae bloom in North Pacific Ocean",
    "20925029": "American Phrase Book",
    "20925092": "Bloomberg’s American Mall game (2018)",
    "20925169": "The Government Won’t Let Me Watch Them Kill Bison, so I’m Suing (2015)",
    "20925228": "Jack Ma retires as Alibaba’s chairman",
    "20925999": "OpenVPN vs. WireGuard – A Short Comparison",
    "20926563": "Django 3.0 alpha 1 released",
    "20926608": "The Riemann Hypothesis (Part 2)",
    "20926655": "Berlin crash prompts calls to ban SUVs from German cities",
    "20926826": "Study blames glyphosate for gluten intolerance and celiac disease epidemic",
    "20926920": "How Safari and iMessage Have Made iPhones Less Secure",
    "20927031": "Frustrations with React Hooks",
    "20927093": "Margrethe Vestager stays on as EU competition head in blow for tech giants",
    "20927099": "NSA Official: We Need to Prepare for the Future of War",
    "20927283": "Why do we use word embeddings in NLP?",
    "20927410": "Where Quantum Probability Comes From",
    "20927431": "Secret Service Investigates Breach at U.S. Govt IT Contractor",
    "20927465": "I Lost My $50k Twitter Username (2014)",
    "20927466": "California Labor Bill, Near Passage, Is Blow to Uber and Lyft",
    "20927585": "Show HN: Search Engine on the Top of Twitter to Find Jobs",
    "20927790": "Myanmar Prepares to Migrate from Zawgyi to Unicode",
    "20927811": "Face recognition, bad people and bad data",
    "20927832": "Firefox’s Test Pilot Program Returns",
    "20928067": "WeWork Bonds Drop Below Par for First Time Since IPO Filing",
    "20928080": "Apple Dominates App Store Search Results, Thwarting Competitors",
    "20928161": "The Amazon Is Not the Earth’s Lungs",
    "20928190": "Runaway Story or Meltdown in Motion? The Unraveling of the WeWork IPO",
    "20928384": "Stripe Corporate Card",
    "20928536": "Xip.io: Wildcard DNS for Everyone",
    "20928570": "It's later than you think",
    "20928653": "Epstein Was a Known Sex Offender. Bezos, Musk and Brin Dined with Him Anyway",
    "20928837": "Khashoggi children have received houses in Saudi Arabia and monthly payments",
    "20928902": "Sex lives of app users 'shared with Facebook'",
    "20929070": "Why Are America’s Three Biggest Metros Shrinking?",
    "20929412": "What College Admissions Want",
    "20929419": "Gas Plants Will Get Crushed by Wind, Solar by 2035: Study",
    "20929704": "Americans' fear of losing their jobs grows",
    "20929774": "Show HN: The Whole Code Catalog",
    "20929796": "Michael Bloomberg launches $160M initiative to ban flavored e-cigarettes",
    "20929801": "Show HN: Browse Reddit in 3D",
    "20929861": "Kuma, a new universal service mesh",
    "20930270": "Evolving “nofollow” – new ways to identify the nature of links",
    "20930439": "Ask HN: How do you keep your programming motivation up?",
    "20930498": "Humans Who Are Not Concentrating Are Not General Intelligences",
    "20930622": "Mayo Clinic to partner with Google",
    "20930649": "Calcium could replace lithium in batteries that store solar and wind power",
    "20930652": "Why Ada Is the Language You Want to Be Programming Your Systems With",
    "20930765": "Apple has unveiled the new seventh-gen iPad",
    "20930986": "Technical Breakdown of a new NES game written in Lisp",
    "20931042": "Apple Watch Series 5",
    "20931086": "Bill Gates: I met with Epstein because “he knows a lot of rich people”",
    "20931361": "Kuma – Open-source control plane for your Service Mesh",
    "20931499": "Plasma Antenna",
    "20931512": "Bring Back the SE",
    "20931533": "Photographer Robert Frank has died",
    "20931551": "Expert predicts 25% of colleges will fail in the next 20 years",
    "20931644": "Uber lays off 435 people",
    "20931678": "iPhone 11 Pro and iPhone 11 Pro Max",
    "20931801": "On Extractive and Abstractive Summarization with Transformer Language Models",
    "20932106": "Weakness in Intel chips lets researchers steal encrypted SSH keystrokes",
    "20932350": "Free-to-Play Games: Three Key Trade-Offs",
    "20932433": "The Plot to Assassinate Orwell",
    "20932904": "Mozilla Launches a VPN, Brings Back the Firefox Test Pilot Program",
    "20933080": "Electric version of Renault's low-cost Kwid",
    "20933366": "Terror Watch List Finally Reined In",
    "20933424": "San Diego Cell Service Possibly Affected by New Operator in Mexico",
    "20934347": "An Interactive Introduction to Fourier Transforms",
    "20934675": "I Quit Social Media for a Year",
    "20934919": "Leadership Transition Announced for MIT Media Lab",
    "20934923": "Can genetics explain why some people thrive on less sleep?",
    "20935409": "Socrates Was Against Writing (2011)",
    "20935492": "Metronomes in JavaScript",
    "20935660": "DontDuo: Bypass 2FA with DTMF Tones",
    "20935750": "Clubhouse announces new collaboration tool, free project management platform",
    "20935813": "Xinjiang University President Tashpolat Tiyip Sentenced to Death in Secret Trial",
    "20935890": "Drought Has Revealed Spain's Long-Submerged 'Stonehenge'",
    "20936210": "Natural Language in Python Using SpaCy: An Introduction",
    "20936388": "The Economic Consequences of the Peace by John Maynard Keynes, 1919",
    "20936466": "Hong Kong can be a gateway to liberal values for China",
    "20936472": "Buster Keaton and the Art of the Gag (2015) [video]",
    "20936565": "How to repair the parts that explode in Lenovo yoga laptops",
    "20936610": "California passes bill that classifies gig economy workers as employees",
    "20936709": "The Volfefe Index",
    "20936782": "California senate passes AB5 gig-work bill, turning contractors into employees",
    "20937062": "Stop Infinite Scrolling",
    "20937199": "Almost all Collatz orbits attain almost bounded values",
    "20937215": "Rich Hickey on Datomic (2012) [video]",
    "20937365": "Paul Bernays Lectures",
    "20937371": "Caniuse and MDN compatibility data collaboration",
    "20937555": "How the UK Security Services neutralised The Guardian",
    "20937950": "Malaria breakthrough as scientists find ‘highly effective’ way to kill parasite",
    "20938011": "Fairphone 3 Teardown",
    "20938057": "Hackers Hit Twitter CEO Jack Dorsey in a ‘SIM Swap’",
    "20938187": "Turn off DoH, Firefox",
    "20938279": "The CIA's Secret Quest For Mind Control",
    "20938292": "E.U.’S New Digital Czar: ‘Most Powerful Regulator of Big Tech’",
    "20938327": "The U.S. Forgot What Antitrust Is For",
    "20938411": "Edward Snowden: Permanent Record",
    "20938681": "What happens to tech workers when their skills become obsolete?",
    "20938780": "Trucking 'bloodbath': 4,500 truck drivers lost jobs in August",
    "20938852": "The iPhone and Apple's Services Strategy",
    "20938906": "Intel GPU Instruction Set Architecture Gets First Overhaul Since 2004",
    "20939161": "How the Many-Worlds Theory of Hugh Everett Split the Universe",
    "20939338": "In the Netherlands, a group of scientists is working on feeding 11 billion",
    "20939346": "Giving Up Meat Won’t Have Much of an Effect on Climate Change",
    "20939395": "The speed reading fallacy: the case for slow reading",
    "20939425": "Hong Kong Exchanges Bids $39B to Take over London Stock Exchange",
    "20939467": "Are black holes made of dark energy?",
    "20939548": "People Recognize Objects by Visualizing Their “Skeletons”",
    "20939688": "The Handshake Network wants to reinvent DNS",
    "20939903": "Day Trading for a Living?",
    "20939904": "Harvesting LinkedIn data for fun and profit",
    "20940341": "Bugs That Became Features",
    "20940409": "Physicists finally nail the proton’s size, eliminating an anomaly",
    "20940535": "Lambdas for C – sort of",
    "20940708": "An advanced nanotube computer may keep Moore’s Law alive",
    "20940717": "Prohibition Tossed a Wet Blanket on America’s Inventors",
    "20941039": "NY Payroll Company Vanishes with $35M",
    "20941089": "It's A-Me, HTML Mario",
    "20941191": "Ask HN: What are some more authentic online forums?",
    "20941738": "Compensation in 2019 – new grad tech offers",
    "20941974": "Professor quietly takes student’s work and files it as a patent in China",
    "20942391": "SoftBank and WeWork Are as Bad as Each Other",
    "20942543": "Postmortem: Every Frame a Painting (2017)",
    "20942767": "The Soul of Erlang and Elixir [video]",
    "20942910": "Trump Administration Weighs Ban on Flavored E-Cigarettes",
    "20943271": "CTRL: A Conditional Transformer Language Model for Controllable Generation [pdf]",
    "20943272": "WWII Radio Listener Security",
    "20943282": "The Coming Calamity (2018)",
    "20943288": "Take your professional skills to the next level with free, online courses",
    "20943304": "Cloud-Services Company Cloudflare Discloses Potential Sanctions Violations",
    "20943306": "The Other 9\/11",
    "20943319": "The world’s smallest big rocket company",
    "20943323": "Consumer Reports launches digital lab to rate on privacy, inform policy",
    "20943346": "Run a private DNS over HTTPS service",
    "20943365": "Show HN: Simple end-to-end email testing",
    "20943399": "Sling TV Review: Channels, Sling TV Packages, DVR, and More",
    "20943406": "Release Notes for Windows Subsystem for Linux (Build 18980)",
    "20943416": "Using WhatsApp to encourage reading and literacy",
    "20943425": "A full breakdown of ConvertKit's $64,944 AWS bill",
    "20943449": "Hubble spots liquid water on a ‘super-Earth’ 110 light-years away",
    "20943464": "Another Interstellar Object Detected in the Solar System",
    "20943485": "Understanding Big O and Algorithmic Complexity",
    "20943491": "“Fight Club” presaged the darker corners of the internet",
    "20943505": "What's the Truth with Badger Culling?",
    "20943507": "Show HN: A Free 3rd Party API Status Dashboard",
    "20943511": "End-to-End Kubernetes Workflow with Garden and Terraform",
    "20943518": "Social Media in 1979? Yes",
    "20943527": "Docker Not Doomed?",
    "20943532": "Tiny Pacific Nation Is Making a Go of Its Own Digital Currency",
    "20943533": "'Irrelevant': panel pours scorn over Google's ideas for Toronto smart city",
    "20943540": "Patron License 1.0.0",
    "20943545": "U.S. Engineering Salaries Jump; Smartphone Developers Win Big",
    "20943550": "Alien world found to have water vapor and possibly rain clouds",
    "20943565": "We Asked Prosecutor If Health Insurance Companies Care About Fraud. They Laughed",
    "20943566": "Men have higher sex drive after having a vasectomy",
    "20943568": "Elsevier investigates hundreds of peer reviewers for manipulating citations",
    "20943590": "SSC Journal Club: Relaxed Beliefs Under Psychedelics and the Anarchic Brain",
    "20943611": "Secured Android Smartphone",
    "20943612": "DNA Company Tampered with Results",
    "20943613": "The Halfword Heap Emulator (2011) [pdf]",
    "20943615": "Controlled modelling of human epiblast and amnion development using stem cells",
    "20943619": "Firefox Private Network Privacy Notice",
    "20943627": "Lulubox iOS",
    "20943633": "After 9\/11, I Raised My Daughters Alone",
    "20943651": "Bunz Update",
    "20943676": "Price Analysis",
    "20943700": "Kreuger: Genius and Swindler – Introduction",
    "20943724": "Scientists Create a Device That Can Mass-Produce Human Embryo-Like Structures",
    "20943735": "The hero who saved everything you love about modern cities",
    "20943773": "CA and AL aren't participating in the multi-state Google antitrust case",
    "20943775": "Reimagining Experimentation Analysis at Netflix",
    "20943781": "Cryptography 2019 Takeaways",
    "20943788": "Ask HN: How long does Stripe Issuing take to respond?",
    "20943792": "Galois Inc. Tech Talk: A Verified LL(1) Parser Generator",
    "20943797": "A Hedge Fund Frankenstein",
    "20943809": "Reproducing \"A Large-Scale Study of Programming Languages and Code Quality\"",
    "20943813": "Meetup Closes My Group but Keeps My Money",
    "20943824": "Venezuela's largest bank opens up petro cryptocurrency wallet registrations",
    "20943844": "Multiple Ways of API Integration in Your JAMStack",
    "20943865": "What are the implications of gig workers=employees for companies like Google?",
    "20943866": "Absolute Scale Corrupts Absolutely",
    "20943869": "Samurra Air Battle",
    "20943881": "Time Management – Get my stuff done (2010) [video]",
    "20943893": "Show HN: Find your best times of day",
    "20943918": "Switzerland's guidance on stablecoins – what it means for Facebook's Libra",
    "20943923": "PrivacySafe: The Anti-Cloud Appliance",
    "20943935": "Aiven Now Provides Kafka Connect as a Service",
    "20943937": "The quest to create quality chocolate for a country obsessed with Cadbury (2017)",
    "20943940": "Understanding Form, Function, and Logic of Clandestine Cellular Networks (2009)",
    "20943956": "E-commerce Search Relevance: Is it the most valuable metric?",
    "20943973": "I wasn’t getting hired as a Data Scientist. So I sought data on who is",
    "20943982": "I Need Feedback for BulmaExpression",
    "20943986": "UK Government: Operation Yellowhammer Summary [pdf]",
    "20944005": "Water found on a potentially life-friendly alien planet",
    "20944007": "Themes and Structure in Double Mojo VNs",
    "20944012": "iOS 13 GM continue to reference Apple’s Stereo AR headset efforts",
    "20944018": "Schinderling",
    "20944030": "Purdue Pharma Tentatively Settles Thousands of Opioids Cases",
    "20944033": "Roger McNamee: Facebook’s ‘business model is morally wrong’",
    "20944045": "Worldline puts APIs at the heart of payments services",
    "20944046": "Conveying Info with Repo Badges",
    "20944049": "Control Theory in Container Fleet Management",
    "20944095": "California Bill Makes App-Based Companies (Uber\/Lyft) Treat Workers as Employees",
    "20944104": "Help the environment by not buying a new iPhone",
    "20944118": "Kubernetes – Efficient Autoscaling",
    "20944119": "September 9 2001 Assassination",
    "20944123": "AMD improves real-world boost and idle on Ryzen 3000",
    "20944138": "Police warn Heathrow activists against Friday drone disruption plan",
    "20944148": "What is the new Apple U1 chip?",
    "20944158": "Update on AB5",
    "20944170": "From Communism to Coding: The $7B Bot Billionaire",
    "20944198": "Should VMware Change Its Name?",
    "20944202": "Quibi Teams with BBC News on Daily News Show for Millennials",
    "20944211": "Lessons from the Screenplay – Jurassic Park: Using Theme to Craft Character",
    "20944222": "Ten Rules for Negotiating a Job Offer",
    "20944224": "Comb, a suite of monospaced fonts ideal for designing forms",
    "20944226": "Ask HN: How do email verification providers like zerobounce.net work?",
    "20944254": "Airwars Conflict Data Visualisation",
    "20944255": "Managing Effective Data Science Teams",
    "20944259": "A Conditional Transformer Language Model for Controllable Generation",
    "20944266": "How we will know when a recession is coming?",
    "20944284": "Google Contributed $40K to AG Not Participating in Anti-Trust Investigation",
    "20944308": "The Mercedes EQS Concept Is Svelte, Sensuous and Sustainable",
    "20944337": "You Might Not Need GraphQL, Serverless or RESTful",
    "20944343": "Handmaid's Tale Sequel Published",
    "20944355": "Racial disparities in voting wait times: evidence from smartphone data",
    "20944363": "Lispy language for creating NES \/ Famicom software",
    "20944368": "Apple apparently testing AR glasses, but don't expect them anytime soon",
    "20944388": "Nanowires replace Newton’s famous glass prism",
    "20944403": "Why is Rust slightly slower than C?",
    "20944405": "A Structural Reevaluation of the Collapse of World Trade Center 7",
    "20944411": "Apple iPad 2019 hands-on: A 6th-generation iPad in a 2019 iPad Air’s body",
    "20944416": "China scraps foreign credit and investment quotas",
    "20944419": "Uber Says It Is Not Subject to California Gig-Worker Law",
    "20944424": "New game 'Sayonara Wild Hearts' Hits PS4 and Switch the Same Day as Apple Arcade",
    "20944437": "Firewalls Not Architected for IIoT",
    "20944441": "Raytheon: UFO's aren't real, unless our company can make money from them",
    "20944473": "Leon Cooperman Warns Private Equity Is a Risky Bet",
    "20944498": "Cloudflare Boosts IPO Range to $14 per Share, Raising Max Val to $4.2B",
    "20944519": "We Built a Lucene-Inspired Parser in Go",
    "20944526": "Lo-Fi Marketing Hack for SaaS Sites: Use Advanced Google Search Operators",
    "20944544": "A $60k Patrol Boat and a Single Deck Gun Changed the Course of Korean War",
    "20944547": "Deaths of 9\/11 first responders from Ground Zero-related illnesses on the rise",
    "20944565": "Show HN: Boltcutter – Recommended tools for product designers and engineers",
    "20944574": "A\/B test blog titles and topics",
    "20944595": "Show HN: Send Instant Email with SendMail",
    "20944606": "281 Alleged Email Scammers Arrested in Global Sweep",
    "20944607": "Microsoft Linux Conference WSLconf Coming March 2020",
    "20944619": "Japan may have to dump radioactive Fukushima water into Pacific, minister says",
    "20944637": "Ask HN: Teach me to write 3rd party java script please?",
    "20944646": "Some thoughts on differential equation notation – functional vs. classical",
    "20944652": "Show HN: Stop giving out your email address online",
    "20944656": "It now costs $350k a year to live a middle-class lifestyle in a big city",
    "20944661": "PID Loops and the Art of Keeping Systems Stable",
    "20944689": "Daniel Johnston, Enigmatic Singer-Songwriter, Is Dead at 58",
    "20944698": "The Rise of Junk Science",
    "20944716": "Why JAMStack",
    "20944726": "Oil tycoon T. Boone Pickens dies at age 91",
    "20944729": "Xterm.js 4.0",
    "20944742": "Pushing the limits of a world class chat bot",
    "20944744": "The Water Vapor Find on 'Habitable' Exoplanet K2-18b",
    "20944748": "Trump administration moves to ban flavored e-cigarettes",
    "20944766": "A tool for testing web applications built with Open API \/ Swagger",
    "20944790": "The Only Voice That Matters in the iBuyer Debate Is the Consumer's",
    "20944808": "Meet LEO, the world’s first business computer (2018)",
    "20944841": "Various Techniques of Face Recognition",
    "20944847": "Ask HN: Replicating the Study on Detecting Lung Cancer Using Deep Learning",
    "20944853": "What makes a mathematician tick? (Explaining BSD to computer scientists) [pdf]",
    "20944859": "Underpopulated Italian region offers visitors €25,000 to move in",
    "20944861": "Parity 7.0.0-Pre.1",
    "20944896": "Forbes Cloud 100",
    "20944902": "MailGirl – A RESTful service for sending templated emails upon request",
    "20944910": "4-Star Admiral Says UFO Sightings Occurred over a “Finite Period”",
    "20944912": "Moving Your JavaScript Development to Bash on Windows",
    "20944913": "Hurd, Oracle CEO takes leave of absence",
    "20944923": "China Lost the United States First",
    "20944961": "Be patient, overnight success takes many years",
    "20944970": "Most in Demand Skills for JavaScript Engineers",
    "20944982": "The iPhone is stepping up its camera game",
    "20944997": "Chinese Scientists Try to Cure One Man's HIV with Crispr",
    "20945009": "Interstellar Comet Gb00234",
    "20945010": "Istio by Example",
    "20945093": "Would anyone use a charitable payments API?",
    "20945106": "Ask HN: Why are browsers so bad at stopping popups and other dark patterns?",
    "20945123": "Huawei may sell its 5G technology to a Western buyer",
    "20945137": "Bletchley's wartime codebreakers meet again",
    "20945144": "Destroying the Amazon is bad for business",
    "20945187": "Ask HN: Has anyone become a licensed realtor just to save 3% on commission?",
    "20945195": "US Patent: Method of swinging on a swing (2000)",
    "20945254": "iOS 13 and Xcode 11 Changes That Affect Push Notifications",
    "20945257": "An Analysis of My Lemote Yeeloong Hardware",
    "20945266": "Flirtey: Drone Delivery Startup",
    "20945294": "Brent Shavnore: The Most Astonishing Case of Image Theft I've Ever Seen",
    "20945295": "Ehang 184 passenger drone commuting in China",
    "20945297": "Impossible at Home",
    "20945299": "Farmers Who Don’t Trust U.S. Data Vow to Hoard Until Prices Rise",
    "20945328": "Carve Out a Niche of AWS",
    "20945344": "OLN: My humble beginning for creating a backchannel for the internet",
    "20945376": "The iPhone and Apple’s Services Strategy",
    "20945384": "Social media linked to increased risk of mental health problems",
    "20945407": "Notes on the Question – What Is a Startup?",
    "20945420": "Show HN: Candidate Dashboards for the 2020 Democratic Primary Field",
    "20945426": "Chatbot for your Facebook page 6 months free Sign up now! Manychat alternative",
    "20945434": "Google Reprimanded by Australian Electoral Commission over Investigation",
    "20945459": "iFixit gives Fairphone 3 a perfect 10 for repairability",
    "20945479": "Chippo sold 7 months of inventory in 1 day",
    "20945514": "Atari ST FD Hardware",
    "20945515": "Life at 400 (2016)",
    "20945517": "Dreamcast launched September 1999",
    "20945519": "Scientists detect the ringing of a newborn black hole for the first time",
    "20945541": "The Song That Hong Kong's Protesters Are Calling Their 'National Anthem'",
    "20945551": "Candidates for Mozilla's IRC Successor",
    "20945552": "Build Your Own Programming Language with Scala",
    "20945558": "YouTube creators begin shifting channels after FTC fine leaves futures in doubt",
    "20945565": "I built a unified view of our ad spend with Parabola",
    "20945566": "CS0618: ‘Device.OS’ is obsolete: ‘TargetPlatform is obsolete as of version 2.3.4",
    "20945574": "Supreme Court Backs New Trump Asylum Restrictions",
    "20945581": "Logical Problem-Solving to End the Climate Emergency",
    "20945602": "Ask HN: Why are leaders given offices in an open office layout?",
    "20945606": "Cash-strapped BART considers spending $227M on new downtown Oakland HQ",
    "20945621": "Show HN: Generate Pop Music with the Transformer",
    "20945658": "Stripe launches in eight more European countries",
    "20945666": "Ask HN: Good examples of open source SaaS?",
    "20945673": "Sophos releases Sandboxie 5.31.4 for free",
    "20945674": "A Ramen Master Cooks at Home",
    "20945734": "Debugging Stack Overflow",
    "20945742": "San Jose: New police portal lets residents quietly report suspected ‘johns’",
    "20945745": "Why Talking to Strangers Is the Best Thing You Can Do for Your Mental Health",
    "20945751": "China blocks US video-conferencing tool Zoom",
    "20945755": "Would you rather have a lighter racing car or a more powerful one?",
    "20945761": "Feature Visualization How neural networks build up their understanding of images",
    "20945762": "My First LLVM Compiler (2015)",
    "20945772": "Ask HN: Good MOOC\/course on computer software\/hardware performance engineering?",
    "20945778": "Justify Failed a Drug Test Before Winning the Triple Crown",
    "20945798": "Ask HN: when to reach for Rust?",
    "20945819": "A high-speed network driver written in C, Rust, Go, C#, Java",
    "20945823": "You’re ‘Raised Right’ When You’re Poor",
    "20945830": "With the intimidation of a tech expert, the Ola Bini case hits a new low",
    "20945848": "Show HN: Add texting to your landline in ~5 minutes",
    "20945856": "California Approves Statewide Rent Control",
    "20945857": "Groupon Said to Be Pursuing Acquisition as Business Faces Investor Pressure",
    "20945875": "Southern Railway Saluda Grade Training (1982) [video]",
    "20945876": "Ask HN: Best Way to Blog from Mobile?",
    "20945877": "Show HN: An Android-Based Touch Screen Document Scanner",
    "20945880": "Why Media Lab thought it was doing right by secretly accepting Epstein’s money",
    "20945909": "AWS Concepts: From a to Z",
    "20945911": "We Lost the War in Afghanistan. Get over It",
    "20945916": "McDonald's is to replace human servers with voice gen in its US drive-throughs",
    "20945933": "Cybercrime Black Markets: RDP Access Remains Cheap and Easy",
    "20945940": "Deploy a Private DoH Service",
    "20945954": "Show HN: Sshwifty WebSSH (Alpha)",
    "20945989": "Hype vs. Reality at the MIT Media Lab (Open Ag Initiative)",
    "20946008": "Ask HN: Fired from my first job – how do I talk about it during interviews?",
    "20946024": "Los Angeles approves 'historically low cost' solar+storage project",
    "20946043": "Walking Truck",
    "20946058": "Copying features doesn't work, except when it does",
    "20946120": "Swing in Austin",
    "20946165": "Parents lead police to massive drug bust of counterfeit vaping cartridges",
    "20946187": "The Real Heroes Are Dead (2002)",
    "20946206": "LifeSaver Liberty:Worlds’ First Water Purifier Bottle with an Inline Pump",
    "20946221": "Archaeologists unearth mass graves from Mongol invasion of Russia",
    "20946239": "Dissatisfied with Docker",
    "20946242": "Hot Patching SQL Server Engine in Azure SQL Database",
    "20946244": "Are you ready to improve your team engagement once and forever?",
    "20946295": "General Fragment Model for Information Artifacts",
    "20946302": "Recipe for disaster: The meteoric rise and ongoing demise of Blue Apron",
    "20946321": "Amazon Is a Logistical Disaster",
    "20946327": "Why Psychotherapy Works",
    "20946340": "Dependency Injection and Inversion Explained – Node.js with TypeScript",
    "20946363": "Show HN: Commission-Free International Payments",
    "20946370": "The electric cars are here, now how about selling them",
    "20946371": "Sandboxie is now a free tool with plans to transition it to an open source tool",
    "20946378": "Conjugate Priors Basics",
    "20946400": "Advertising the Altair 8800",
    "20946408": "Teenager loses memory every two hours after being kicked in the head",
    "20946459": "A new funding model for open source software",
    "20946541": "Show HN: Control Freak for Bitbucket Server (git pre-receive hook)",
    "20946544": "Yet Another PC – Mac Video",
    "20946545": "Asteroid Discovery – 1970-2015 [video]",
    "20946583": "Ask HN: What are things I can learn within 1 hour that will make me a better SE?",
    "20946653": "Ask HN: How do you stay organized at work?",
    "20946746": "The most powerful lightning bolts",
    "20946750": "The campaign to ban conversion therapy",
    "20946770": "The new battle in Hong Kong isn’t on the streets; it’s in the apps",
    "20946771": "Span Selection Pre-Training for Question Answering",
    "20946816": "The Black Hand",
    "20946847": "Our Open-Plan Office Failed, So We’re Moving to a Towering Panopticon (2017)",
    "20946866": "Tesla Installs First Customer Upgrade to Full Self Driving Hardware",
    "20946877": "Please Help If You Can – My Brother Needs Brain Surgery",
    "20946903": "Fancy coffee becomes a must-have office perk",
    "20946906": "Show HN: Scrape Linkedin with Python",
    "20946910": "Stripe Sessions Keynote",
    "20946976": "The BusTub Relational Database Management System (Educational)",
    "20946996": "Can Anyone Live in Full Software Freedom Today?",
    "20946999": "New metamaterial morphs into new shapes, taking on new properties",
    "20947017": "Argentina announces new round of currency controls amid economic crisis",
    "20947026": "Michael Schumacher 'conscious' after pioneering treatment in Paris",
    "20947028": "Reconsidering Monetary Policy: The Relationship Between Interest Rates and GDP",
    "20947032": "Study suggests that maybe our morals are determined by our political affiliation",
    "20947042": "Britain slumps to bottom of cancer survival tables",
    "20947054": "There's an Actual Guy Named 'Justin' Making Those Nut Butter Packets",
    "20947069": "Live DEBATE: Can VC's predict the future of cryptocurrency exchanges?",
    "20947085": "NetCAT – network based cache side-channel attack on modern Intel processors",
    "20947100": "New study points to universal code in our brains for what we find beautiful",
    "20947113": "Do Brain Supplements Work?",
    "20947115": "35C3 – Inside the AMD Microcode ROM",
    "20947184": "Death Because of Vaping in the United States? Not Really",
    "20947222": "Immer is a library of persistent and immutable data structures written in C++",
    "20947226": "Deploying Azure Functions with Tekton CI\/CD",
    "20947234": "Co-CEO of Oracle taking a leave of absence citing health reasons",
    "20947237": "Meta-learnt priors slow down catastrophic forgetting in neural networks",
    "20947315": "When Medicaid Takes Everything You Own",
    "20947343": "Telegram open network – the new blockchain",
    "20947380": "From the Experts: Top Trends Shaping the Future of Software Testing – QASymphony",
    "20947382": "St. Petersburg Paradox",
    "20947393": "Letter to an Astrophysicist",
    "20947414": "Ask HN: Would allowing multiple querystrings in URLs allow more scalable APIs?",
    "20947424": "Ten Simple Rules for Structuring Papers (2017)",
    "20947429": "Prosus at $105B biggest consumer internet company in Europe",
    "20947453": "Free open source IPTV\/Media cloud service",
    "20947461": "Using Uber for Business could cost you your personal Uber account",
    "20947478": "Lord Buckethead",
    "20947520": "One of the world's biggest porn sites is branching into fine art",
    "20947526": "Submit Your WatchOS Apps to the App Store",
    "20947539": "The Church-Turing Thesis and Physics – Scott Aaronson",
    "20947542": "How Hardware Can Bias AI Data",
    "20947561": "Free Web design resources website to bookmark",
    "20947576": "2020 LDAP channel binding and LDAP signing requirement for Windows",
    "20947577": "Medicaid's Dark Secret",
    "20947610": "Australia considers porn site age verification similar to troubled UK system",
    "20947631": "Rock Pi X Intel Cherry Trail Board",
    "20947654": "Transfer of Temporal Logic Formulas in Reinforcement Learning",
    "20947657": "Watch Tesla's Record-Breaking Laguna Seca Lap",
    "20947685": "You Can't Even See This Hypersonic Sled Hit 6,599 MPH",
    "20947687": "Master Image Tracking with ARKit 3 – Part 2",
    "20947740": "Baby with extremely rare mutation in GPX4 gene",
    "20947744": "If computers are so smart how come they can't read?",
    "20947775": "JRE – Nick Bostrom",
    "20947800": "Bobby Lee Returns with Ballet, a Crypto Hardware Wallet for the Masses",
    "20947806": "Article: Using Java to Orchestrate Robot Swarms",
    "20947819": "Debian 10: Playing catch-up with the rest of the Linux world",
    "20947829": "California AB5 may cause franchise owners to be reclassified as employees",
    "20947830": "The effectiveness of writing startup updates for your mentors",
    "20947858": "People throwing their Juuls out windows and drenching them in water just to quit",
    "20947864": "Show HN: A zero configuration remote monitoring tool that's better than nothing",
    "20947877": "New iPhone 11 and iPhone 11 Pro Models Ditch 3D Touch in Favor of Haptic Touch",
    "20947896": "Amazon Photo Downloader – A Helpful Python Script",
    "20947901": "Reactive Foundation Launched Under the Linux Foundation",
    "20947917": "The Perils of Billionaire Philanthropy",
    "20947921": "Show HN: Trumpspired: Posters inspired by number 45",
    "20947934": "Security Information Event Management (SIEM) in AWS",
    "20947936": "Pagers, Pay Phones, and Dialup: How We Communicated on 9\/11",
    "20948022": "Political Diversity in Social and Personality Psychology (2012)",
    "20948050": "I Prepared for and Passed the Oracle Database SQL Certification (1Z0-071)",
    "20948052": "AWS announces Kubernetes IAM role switching for pods",
    "20948053": "Announcing the Urban Institute Data Catalog",
    "20948064": "New iPhone Hack Shock as China Blamed for Devastating Attack: Report",
    "20948082": "Will Fasting Help You Live Longer? [video]",
    "20948088": "The Plonk Stack for Cloud Native Developers",
    "20948089": "Brexit, Democracy and the Sacred",
    "20948113": "Female CEOs Blast Forbes List of Innovative Leaders That Includes Only One Woman",
    "20948140": "Tesla announces Model S with ‘Plaid powertrain’ and new ‘chassis prototype’",
    "20948144": "Citation bubble about to burst? (2011)",
    "20948150": "Modern Applications at AWS",
    "20948153": "The nuclear war America planned to fight over her own cities (2017)",
    "20948163": "TikTok launches campaign asking people to pledge they will think before posting",
    "20948167": "Getting Started with Text Preprocessing for Machine Learning and NLP",
    "20948179": "An extra-uterine system to physiologically support the extreme premature lamb",
    "20948213": "New Golang Publication",
    "20948220": "Squash: The Debugger for Microservices",
    "20948228": "Boeing's travails show what's wrong with modern capitalism",
    "20948241": "Apple needs to stop comparing iPad to PC",
    "20948246": "Advertising executives point to five ways Google stifles business",
    "20948257": "Operation reWired: 281 suspected email scammers arrested around the world",
    "20948274": "DeepPrivacy: A Generative Adversarial Network for Face Anonymization",
    "20948298": "Berkeley Smorgasbord Part 2",
    "20948307": "Dungeon Crawling or Lucid Dreaming?",
    "20948308": "A Talk with XKCD’s Creator, Randall Munroe",
    "20948345": "Lazy Loading Angular Libraries",
    "20948353": "Brief Thoughts and Observations on Yesterday’s Apple Event",
    "20948373": "Topics from the 2019 Linux Open Printing Micro-Conference",
    "20948379": "California Bill Makes App-Based Companies Treat Workers as Employees",
    "20948395": "How NLP Works?",
    "20948398": "Cities Where Job Growth Is Outpacing New Homes",
    "20948401": "Ask HN: How much does it cost to maintain your own fork of a FOSS project?",
    "20948412": "What Happened to the Real Time Strategy Genre?",
    "20948434": "Ban children from gambling in games, MPs say",
    "20948441": "Human Progress is a Lie",
    "20948450": "Undefined",
    "20948451": "Instagram “Clips” clones TikTok’s video editor in prototype",
    "20948465": "Wintergatan's “Marble Machine”, in Minecraft [video]",
    "20948476": "Valuable ways to attract new investors through a digital medium",
    "20948480": "How to Make Custom AI-Generated Text with GPT-2",
    "20948494": "Free kotlin android app tutorial",
    "20948496": "Jsteg is a package for hiding data inside JPEG, a technique called steganography",
    "20948512": "Automattic Plans to Acquire Tumblr",
    "20948519": "Apple hid a secret message in its latest YouTube video",
    "20948521": "Keybase.md",
    "20948522": "Elon Musk promises to take Tesla Model S to ‘Plaid’ with new powertrain",
    "20948532": "Why iPhone11 back camera lens design is annoying? Any engineering reason?",
    "20948534": "Inventing on Principle (2012)",
    "20948555": "Key Kubernetes Concepts",
    "20948573": "How to build a smaller Docker image",
    "20948575": "Investing in the Future 200 years in the past",
    "20948577": "The Things That Mathematics Cannot Explain",
    "20948590": "Built a quick job aggregator using APIs to find jobs in UAE",
    "20948596": "Society Is Built on Abstraction",
    "20948613": "Parasite SEO",
    "20948630": "French company liable after employee dies during sex on business trip",
    "20948631": "PSD2 will affect in-store payments",
    "20948655": "Operation Yellowhammer: the UK government's no-deal Brexit planning assumptions [pdf]",
    "20948660": "Ask HN : Why no one thought about way to find a grocery price api?",
    "20948668": "Increase 512mb upload limit to 2M TeraByte- AIOWP migration plugin",
    "20948678": "Ask HN: How much time do you spend deciding what to wear everyday?",
    "20948683": "Ship of horrors: life and death on the lawless high seas",
    "20948700": "Show HN: Faster Pageload FF Plugin – Load Websites Faster by Preloading Them",
    "20948721": "Spotify Crack Chrome App 2020",
    "20948729": "Ask HN: Will you buy one of the new iPhones?",
    "20948735": "Why a Newsletter?",
    "20948737": "Ask HN: What's the fastest way to get updated on what's trending on Hacker News?",
    "20948747": "Upside-Down-Ternet",
    "20948748": "Welcome to the Culture (2008)",
    "20948757": "On Automating Everything – Cloud Container Provisioning on AWS",
    "20948760": "Salesforce releases language model bigger than GPT-2 large",
    "20948774": "Administration considers disused California FAA facility for homeless population",
    "20948788": "'Red mercury': why does the myth persist?",
    "20948795": "Pam and Angela from The Office have a podcast together",
    "20948812": "What can you learn from an IP? [pdf]",
    "20948814": "Logical Operations with CSS Variables",
    "20948816": "Tessellating Regular Polygons",
    "20948821": "Decentralized Architectural Design and Construction Management Network",
    "20948823": "Construction Management Network",
    "20948826": "Can I email is caniuse for email clients. What HTML\/CSS supports each client",
    "20948844": "Learn Python?",
    "20948870": "Gym-City: OpenAI Gym Environment for Training RL Agents to Play SimCity 1",
    "20948880": "Plus – A superset of PHP that makes PHP cool again",
    "20948926": "Canberra will be home to one of Australia's biggest batteries",
    "20948930": "Memory, Explained",
    "20948934": "Ixy.rs: A Rust User Space Network Driver",
    "20948946": "The Life Changing Linguistics of Nigerian Scam Emails",
    "20948952": "Skip-Gram and CBOW Word2Vec Models",
    "20948959": "The Hive – Remote Mastermind Business Groups",
    "20948964": "Ask HN: What do I need to know to make a Bluetooth KVM?",
    "20948972": "Animista – CSS Animations on Demand",
    "20948973": "Behind India's construction boom, a world of ‘systematic slavery’",
    "20949008": "Learning the Hard Way: Microservices",
    "20949016": "Post 9\/11 thread for people to post the wildest shit they remember from 01 to 06",
    "20949031": "Show HN: Free Feature Flags for Developers and Startups",
    "20949051": "Scientists detect the ringing of a newborn black hole for the first time",
    "20949071": "In Defense of Influencers",
    "20949083": "How to use GitHub wiki to speed up code reviews",
    "20949094": "Apple's iPhone 11 Pro 'triggering' fear of holes",
    "20949141": "Start Your Startup in Kinshasa, DRC",
    "20949162": "Office Mechanisation: From Typewriters to AI",
    "20949167": "How to Create a Positive Work Environment That Promotes Mental Health",
    "20949169": "German Out-of-Home ads can now track your position (German)",
    "20949178": "Piketty Inequality Theory",
    "20949196": "I Release to Maven Central in One Click",
    "20949213": "Daniel Johnston Has Died",
    "20949223": "Good sleep, good learning, good life",
    "20949237": "Finland capital city turns itself into a CaaS product to attract developers",
    "20949246": "Solenya: Mega-powerful micro-framework in TypeScript",
    "20949249": "Smart contract code should be easy to read and easy to write",
    "20949269": "Huawei may sell its 5G technology to a Western buyer",
    "20949272": "Biosphere 2",
    "20949277": "Ask HN: Whats Your Experience with AWS Lambda?",
    "20949281": "Show HN: DevTeam Project – Engineering Leadership Podcast",
    "20949305": "‘Big Brother’ in the Sky: Cathay Pacific Workers Feel China’s Pressure",
    "20949324": "The Rise of the Electric Scooter",
    "20949342": "Even when your crypto activities are secured, there are privacy issues",
    "20949346": "Trump: 'unfair' about Eich (2014)",
    "20949359": "An important quantum algorithm may be a property of nature",
    "20949360": "Worms fail to thrive in soil containing microplastics – study",
    "20949363": "Ask HN: How big is the HN community",
    "20949372": "Immersive and addictive technologies report published",
    "20949386": "What Is an LTPO Display?",
    "20949391": "Establishment of the National Quantum Initiative Advisory Committee",
    "20949412": "Show HN: Jsonbox.io – A free HTTP based JSON store",
    "20949441": "He Built a Multi-Million Dollar Business with Zero Paid Advertising",
    "20949448": "OpenAPI Generator (REST API Code Generator) v4.1.2 Released",
    "20949450": "Vive Cosmos",
    "20949468": "Embryo-like structures created from human stem cells",
    "20949471": "Why Did I Have Difficulty Learning React?",
    "20949472": "Cloud-Services Company Cloudflare Discloses Potential Sanctions Violations",
    "20949478": "Maintaining the Kernel's Web of Trust",
    "20949485": "Hong Kong Protests Scare Away 90% of Mainland China Tour Groups",
    "20949495": "Piotrek and CSIRO to make next-gen lithium batteries for global market",
    "20949500": "Longan Nano: $5 RISC-V Micro controller board",
    "20949538": "Heroku Values (2013)",
    "20949543": "Show HN: Sprynkl, the easiest way to get and give feedback",
    "20949548": "EV certs not so extended? How I revoked $1M worth of EV certificates",
    "20949606": "IBM Z15 Technical Introduction",
    "20949625": "Scraping \/ Scripting a Web Page Using Laravel Dusk",
    "20949639": "What's new in Firefox for iOS (version 19)",
    "20949648": "London’s Hidden Cable Tunnels Could Warm Thousands of Homes",
    "20949665": "Show HN: A platform for creating tutorials using Markdown",
    "20949679": "Vox Sentences: The gig economy is in trouble",
    "20949689": "Extinct kangaroo had a branch-crunching bite to rival today’s giant pandas",
    "20949706": "Using physics-based techniques to understand China’s history",
    "20949713": "Draw your own circuits with liquid metal",
    "20949732": "Absolute scale corrupts absolutely",
    "20949737": "Galactic Scale Energy",
    "20949740": "Recovery – Google Recover Together",
    "20949745": "I Started My Own Lingerie Business Side Hustle",
    "20949751": "Comparing Brotli and Gzip",
    "20949762": "What wartime ‘munitionettes’ can teach us about burnout",
    "20949763": "Scientists Find the Skull of Humanity’s Ancestor, on a Computer",
    "20949765": "States with More Computer Science Policies See Increased Female Participation",
    "20949766": "Lots of People Going Around with Mild Hallucinations All the Time",
    "20949767": "Boss of “Bots”",
    "20949769": "Microsoft confirms a Teams client for Linux is on its way",
    "20949773": "ICE Has a New $30M Contract with Israeli Phone Cracking Company Cellebrite",
    "20949776": "Objects can now change colors like a chameleon",
    "20949780": "IBM, Fraunhofer partner on German-backed quantum computing research push",
    "20949783": "AIs that deblur faces could make people on CCTV easier to identify",
    "20949790": "IBM Launches Z15 Mainframe",
    "20949795": "IBM Galvanizes Its Place in Secure Workloads with New Z15 Platform",
    "20949814": "Monsta X and Steve Aoki: how K-pop took over YouTube",
    "20949817": "Ask HN: Is there a point in using privacy-aware email if my contacts are Gmail?",
    "20949818": "On-Chip Optical Links Are One Step Closer to Reality",
    "20949824": "Facebook spiked a legitimate fact check about abortion",
    "20949828": "BlueApron: From a unicorn to NYSE delisting risk",
    "20949830": "South Africa’s MeerKAT discovers giant radio bubbles at centre of Milky Way",
    "20949833": "We Don’t Have an Exit Strategy"
}