{
    "20918080": "Using Spotify data to predict what songs will be hits",
    "20918089": "Map Shows How a Location Has Changed over the Past 750M Years",
    "20918919": "Lingua::Romana::Perligata — Perl in Latin",
    "20919172": "Artificial leaf produces first drugs using sunlight",
    "20919461": "‘We May Have to Shoot Down This Aircraft’",
    "20919948": "Quantum Darwinism spotted in diamond spin",
    "20920753": "9th Circuit holds that scraping a public website does not violate the CFAA [pdf]",
    "20920928": "Effect of High-Dose Vitamin D on Volumetric Bone Density and Bone Strength",
    "20921343": "Don’t Subsidize Companies That Silence Workers",
    "20922250": "Maturity",
    "20922439": "Health system sues thousands of patients, seizes pay and puts liens on homes",
    "20922767": "Human Rights Implications of IBM Watson’s ‘Personality Insights’ Tool",
    "20922827": "Scientists Discover New Evidence of the Asteroid That Killed Off the Dinosaurs",
    "20924581": "Troubles Mount for the We Company as Softbank Reportedly Calls for Shelving IPO",
    "20924667": "It’s not just p=0.048 vs. p=0.052",
    "20924774": "Kīlauea volcano eruption fosters algae bloom in North Pacific Ocean",
    "20925092": "Bloomberg’s American Mall game (2018)",
    "20925228": "Jack Ma retires as Alibaba’s chairman",
    "20927466": "California Labor Bill, Near Passage, Is Blow to Uber and Lyft",
    "20927790": "Myanmar Prepares to Migrate from Zawgyi to Unicode",
    "20927832": "Firefox’s Test Pilot Program Returns",
    "20928161": "The Amazon Is Not the Earth’s Lungs",
    "20928536": "Xip.io: Wildcard DNS for Everyone",
    "20928653": "Epstein Was a Known Sex Offender. Bezos, Musk and Brin Dined with Him Anyway",
    "20929070": "Why Are America’s Three Biggest Metros Shrinking?",
    "20929419": "Gas Plants Will Get Crushed by Wind, Solar by 2035: Study",
    "20930270": "Evolving “nofollow” – new ways to identify the nature of links",
    "20930652": "Why Ada Is the Language You Want to Be Programming Your Systems With",
    "20930765": "Apple has unveiled the new seventh-gen iPad",
    "20931533": "Photographer Robert Frank has died",
    "20931644": "Uber lays off 435 people",
    "20933080": "Electric version of Renault's low-cost Kwid",
    "20933366": "Terror Watch List Finally Reined In",
    "20934923": "Can genetics explain why some people thrive on less sleep?",
    "20935890": "Drought Has Revealed Spain's Long-Submerged 'Stonehenge'",
    "20936210": "Natural Language in Python Using SpaCy: An Introduction",
    "20936388": "The Economic Consequences of the Peace by John Maynard Keynes, 1919",
    "20936472": "Buster Keaton and the Art of the Gag (2015) [video]",
    "20937062": "Stop Infinite Scrolling",
    "20937215": "Rich Hickey on Datomic (2012) [video]",
    "20938011": "Fairphone 3 Teardown",
    "20938279": "The CIA's Secret Quest For Mind Control",
    "20938292": "E.U.’S New Digital Czar: ‘Most Powerful Regulator of Big Tech’",
    "20938327": "The U.S. Forgot What Antitrust Is For",
    "20938906": "Intel GPU Instruction Set Architecture Gets First Overhaul Since 2004",
    "20939161": "How the Many-Worlds Theory of Hugh Everett Split the Universe",
    "20939425": "Hong Kong Exchanges Bids $39B to Take over London Stock Exchange",
    "20940535": "Lambdas for C – sort of",
    "20940717": "Prohibition Tossed a Wet Blanket on America’s Inventors",
    "20942543": "Postmortem: Every Frame a Painting (2017)",
    "20942767": "The Soul of Erlang and Elixir [video]",
    "20943271": "CTRL: A Conditional Transformer Language Model for Controllable Generation [pdf]",
    "20943272": "WWII Radio Listener Security",
    "20943282": "The Coming Calamity (2018)",
    "20943323": "Consumer Reports launches digital lab to rate on privacy, inform policy",
    "20943491": "“Fight Club” presaged the darker corners of the internet",
    "20943550": "Alien world found to have water vapor and possibly rain clouds",
    "20943568": "Elsevier investigates hundreds of peer reviewers for manipulating citations",
    "20943611": "Secured Android Smartphone",
    "20943612": "DNA Company Tampered with Results",
    "20943613": "The Halfword Heap Emulator (2011) [pdf]",
    "20943633": "After 9\/11, I Raised My Daughters Alone",
    "20943700": "Kreuger: Genius and Swindler – Introduction",
    "20943809": "Reproducing \"A Large-Scale Study of Programming Languages and Code Quality\"",
    "20943844": "Multiple Ways of API Integration in Your JAMStack",
    "20943869": "Samurra Air Battle",
    "20943937": "The quest to create quality chocolate for a country obsessed with Cadbury (2017)",
    "20943940": "Understanding Form, Function, and Logic of Clandestine Cellular Networks (2009)",
    "20944045": "Worldline puts APIs at the heart of payments services",
    "20944148": "What is the new Apple U1 chip?",
    "20944211": "Lessons from the Screenplay – Jurassic Park: Using Theme to Craft Character",
    "20944254": "Airwars Conflict Data Visualisation",
    "20944255": "Managing Effective Data Science Teams",
    "20944343": "Handmaid's Tale Sequel Published",
    "20944355": "Racial disparities in voting wait times: evidence from smartphone data",
    "20944544": "A $60k Patrol Boat and a Single Deck Gun Changed the Course of Korean War",
    "20944726": "Oil tycoon T. Boone Pickens dies at age 91",
    "20944790": "The Only Voice That Matters in the iBuyer Debate Is the Consumer's",
    "20945106": "Ask HN: Why are browsers so bad at stopping popups and other dark patterns?",
    "20945123": "Huawei may sell its 5G technology to a Western buyer",
    "20945137": "Bletchley's wartime codebreakers meet again",
    "20945297": "Impossible at Home",
    "20945384": "Social media linked to increased risk of mental health problems",
    "20945514": "Atari ST FD Hardware",
    "20945515": "Life at 400 (2016)",
    "20945517": "Dreamcast launched September 1999",
    "20945519": "Scientists detect the ringing of a newborn black hole for the first time",
    "20945761": "Feature Visualization How neural networks build up their understanding of images",
    "20946024": "Los Angeles approves 'historically low cost' solar+storage project",
    "20946120": "Swing in Austin",
    "20946221": "Archaeologists unearth mass graves from Mongol invasion of Russia",
    "20946321": "Amazon Is a Logistical Disaster",
    "20946370": "The electric cars are here, now how about selling them",
    "20946545": "Asteroid Discovery – 1970-2015 [video]",
    "20946750": "The campaign to ban conversion therapy",
    "20946816": "The Black Hand",
    "20946866": "Tesla Installs First Customer Upgrade to Full Self Driving Hardware",
    "20946976": "The BusTub Relational Database Management System (Educational)",
    "20946996": "Can Anyone Live in Full Software Freedom Today?",
    "20947032": "Study suggests that maybe our morals are determined by our political affiliation",
    "20948053": "Announcing the Urban Institute Data Catalog",
    "20948153": "The nuclear war America planned to fight over her own cities (2017)",
    "20948398": "Cities Where Job Growth Is Outpacing New Homes",
    "20948412": "What Happened to the Real Time Strategy Genre?",
    "20948451": "Instagram “Clips” clones TikTok’s video editor in prototype",
    "20948534": "Inventing on Principle (2012)",
    "20948555": "Key Kubernetes Concepts",
    "20948573": "How to build a smaller Docker image",
    "20948577": "The Things That Mathematics Cannot Explain",
    "20948596": "Society Is Built on Abstraction",
    "20948630": "French company liable after employee dies during sex on business trip",
    "20948655": "Operation Yellowhammer: the UK government's no-deal Brexit planning assumptions [pdf]",
    "20948747": "Upside-Down-Ternet",
    "20948748": "Welcome to the Culture (2008)",
    "20948774": "Administration considers disused California FAA facility for homeless population",
    "20948788": "'Red mercury': why does the myth persist?",
    "20948946": "The Life Changing Linguistics of Nigerian Scam Emails"
}